Title,About 
American Murder: The Family Next Door, 
					It has been a banner year for true crime on Netflix. American Murder: The Family Next Door in particular took the platform by storm upon its October release, and is as heartbreaking as it is gripping. This documentary film tells the shockingly violent tale of a 2018 Colorado familicide, and is pieced together with never-before seen police footage. Not for the faint of heart. Watch Now
			 
The Trial of the Chicago 7, 
					With standout performances from Sacha Baron Cohen, Mark Rylance, and Yahya Abdul-Mateen II, the film follows the real life events of a 1969 trail that looked into possible conspiracy charges against seven men who were protesting at the 1968 Democratic National Convention. And if that short synopsis doesn’t do it for you, then listen to this: you can’t miss the wild accents offered by Eddie Redmayne and Joseph Gordon Levitt.Watch Now
			 
The Boys in the Band, 
					The Boys in the Band, a stage-to-screen adaptation from Joe Mantello, follows the same story from the 1968 stage play of the same name, and yet, it remains peculiarly relevant in 2020. Starring an all-star cast of actors, nine men at the core of The Boys in the Band gather to celebrate a friend's birthday, only for the night to take a turn for the serious. What ensues is an exploration into each of their lives, examining the beautiful, painful complexity of being a gay man in 1968 New York. Bonus fun fact: every actor in the film is reprising their roles from the 2018 Broadway revival, so this crew is seasoned when it comes to bringing the dramatic story to life. Watch Now
			 
Enola Holmes, 
					Millie Bobby Brown produces and stars in Netflix’s adaptation of Nancy Springer’s book series Enola Holmes. Also starring Henry Cavill, Helena Bonham Carter, and Sam Claflin, the film follows the misadventures of Sherlock Holmes’ bright younger sister Enola as she comes into her own as a budding detective. It’s a smart, feminist twist on a classic, packed with fun and suspense. Here’s hoping for a second installment soon. Watch Now
			 
The Devil All The Time, 
					Netflix’s new Gothic period drama The Devil All The Time is based on the novel of the same name by Donald Ray Pollock, who serves as the film's narrator. Examining religion and abuse of power, the film, who’s stacked cast includes Tom Holland, Bill Skarsgård, and Robert Pattinson, is a dark, twisted look at small-town America. Watch Now
			 
I'm Thinking of Ending Things, 
					Charlie Kaufman’s book-to-screen adaptation of I’m Thinking of Ending Things is somehow a smart, tightly written fantasia of horror while also being quite the mind fuck. When an unnamed woman (Maybe Lucy? Maybe not?) heads home with her boyfriend Jake to meet his family, the two find themselves in a reality that isn’t quite concrete. Time shifts. Personas change. There’s a legitimate musical sequence, and the result? Well, let’s just say that it might say as much about you as it does the film. Just watch and see for yourself.Watch Now
			 
Crip Camp , 
					Crip Camp, the latest documentary produced by Barack and Michelle Obama’s production company, has received near-universal praise from critics and viewers. The documentary tells the story of Camp Jened, a summer camp for youths with disabilities that became a hotbed of 1970s activism and helped kickstart the disability rights movement. The film makes extensive use of archival footage, and is co-directed and narrated by James Lebrecht, who’s himself a former camper.Watch Now
			 
Athlete A , 
					One of the most powerful moments of the Me Too era occurred when more than 150 women faced convicted sexual predator Larry Nassar in court to deliver emotional impact statements. But horrifyingly, those women represented just a fraction of the former USA Gymnastics doctor's 500 victims. This documentary from Netflix examines abuses in the gymnastics world, and just how Nassar was able to get away with his crimes for decades.Watch Now
			 
Uncorked , 
					Courtney B. Vance and Niecy Nash alone should be enough to get anyone onboard with Uncorked, one of Netflix’s best reviewed dramas of the year. It tells the story of a young man caught between his parents’ expectations that he take over the family barbecue restaurant and his dream of becoming a master sommelier.Watch Now
			 
The Speed Cubers, 
					This movie may not be much longer than your average episode of a network drama, but it still packs the punch of a feature-length documentary. The Speed Cubers takes a look at the world of competitive Rubik’s Cube solvers by examining the friendship between two world champion cubers.Watch Now
			 
Miss Americana, 
					Taylor Swift is one of the 21st century’s best selling and most talked about artists, a figure who has tightly controlled her public image since she was a teenager. That makes Netflix’s documentary about the star all the more revealing. In the film, Swift opens up about her songwriting process, battling an eating disorder, and her decision to go public with her politics.Watch Now
			 
The Old Guard, 
					The Old Guard sets a new standard for superhero movies. Based on the acclaimed comics from Greg Rucka, the film, directed by Gina Prince-Bythewood, follows a group of near-immortal warriors who have worked for centuries to fight for the betterment of humanity. Led by the ancient warrior Andy (played by Charlize Theron) and the newcomer to their team Nile (Kiki Layne), the film finds a beautiful balance of emotion and action.Watch Now
			 
Eurovision, 
					In a time when everything seems very serious and very bad, Will Ferrell has arrived with a movie that is frivolous and fun and escapist and stupid. Do you want weird European singalongs? Do you want murderous elves? Do you want Ferrell in a flowing blonde wig with a bad Scandinavian accent making fun of Americans? Right now, you absolutely do. Watch Now
			 
Da 5 Bloods, 
					In his follow-up to the Oscar-winning BlackKklansman, Spike Lee sends four Black Vietnam War vets back to the country, where they set off on an adventure to find the body of the leader and the buried treasure they left behind. The film—with a powerhouse performance by Delroy Lindo—is a stunning response to decades of Vietnam films that have ignored the stories of Black heroes.Watch Now
			 
The Lovebirds, 
					Issa Rae and Kumail Nanjiani star as a couple whose fractured relationship hits another snag when they witness a murder and become the top suspects for the crime. This turns into a hilarious adventure with two comedians at the top of their talents as they attempt to solve the crime and clear their names.Watch Now
			 
The Half of It, 
					Netflix might have thought it struck gold with To All The Boys I've Loved Before, but The Half of It feels different. You see, it's the classic story of boy meets girl, boy stumbles on words, employs another girl to write love letters, then girl meets girl, girl falls in love with first girl, but it's okay because guy who originally met girl wants to help second girl realize how wonderful she is being exactly who she is. That's a lot of girls and boys, but the film itself is a delight.Watch Now
			 
Extraction, 
					If you’re in the market for a thrill, Sam Hargrave’s new action-packed film Extraction will keep your heart pumping for two hours straight, from one car chase scene to the next. Chris Hemsworth plays Tyler Rake, a hardened mercenary tasked with the rescue and extraction of a high powered drug lord’s son from a rival drug lord’s kidnapping. He and the boy, Ovi (Rudhraksh Jaiswal), form a bond on their wild journey across Dhaka, Bangladesh that leads Tyler to potentially sacrifice his life for the boy despite the fact that he will no longer receive payment for the mission...but probably not, because they have already announced a sequel.Watch Now
			 
A Secret Love, 
					Move over A League of Their Own; this touching documentary about two women in love is one of the sweetest features currently available on Netflix. Pat Henschel and pro baseball player Terry Donahue formed a relationship over seven decades and for nearly the entirety of it, they kept their love hidden from those around them. Seeing all different shades of prejudice and hardship, the two prove that love runs deeper than hate.Watch Now
			 
Circus of Books, 
					This documentary looks into a decades-old establishment in West Hollywood. In 1976, the book store became known as a salacious underground purveyor of gay pornography, but the secret continued to grow. Eventually, this mom and pop shop run by a nice Jewish couple became the largest purveyor of gay male pornography in the United States and solidified its place within the annals of adult entertainment history.Watch Now
			 
Horse Girl, 
					While some of Netflix's original films have been hit and miss this year, Horse Girl is a welcomed walk on the wild side. The psychological drama, starring Allison Brie, Debby Ryan, and Molly Shannon, is a slow burn look into mental illness that leaves viewers questioning whether the truly bizarre film they've just watched is a meditation on stability or a treat of a sci-fi movie. Hot take: neither answer is bad.Watch Now
			 
All Day and a Night, 
					Jeffrey Wright and Ashton Sanders star in this deeply affecting film about a young man named Jahkor who ends up in the same prison as his father. Leading up to his initial incarceration, the film takes a look at Jahkor's life and how the system and environment he grew up in contributed to his ill-fated future.Watch Now
			 
Murder to Mercy: The Cyntoia Brown Story, 
					This investigative documentary follows the complex case of Cyntoia Brown. At 16, she killed a man after feeling threatened by him during a sex work exchange. She was sentenced to life in prison, but years later, her case gained national attention, eventually garnering the support of celebrity figures. The documentary follows her request for clemency.Watch Now
			 
Lost Girls, 
					When her grown daughter Shannan goes missing on Long Island, Mari Gilbert turns to law enforcement for help. Upon learning Shannan was working as a prostitute the night she disappeared, the police lose interest. Mari’s persistence to continue searching leads the police to bodies of several missing working girls around the area. Based on the book by Robert Kolker, which followed the families and friends of the real victims of the Long Island Serial Killer, Lost Girls shows the lengths a mother will go to in order to get justice for her daughter.Watch Now
			 
